{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "BENIGN",
    "1": "DECEPTIVE",
    "2": "HIGH_RISK",
    "3": "ILLEGAL",
    "4": "INFRASTRUCTURE",
    "5": "MALICIOUS",
    "6": "NSFW"
  },
  "initializer_range": 0.02,
  "label2id": {
    "BENIGN": 0,
    "DECEPTIVE": 1,
    "HIGH_RISK": 2,
    "ILLEGAL": 3,
    "INFRASTRUCTURE": 4,
    "MALICIOUS": 5,
    "NSFW": 6
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
